Cannot create specified transition at rail path turn, hand Rail/Top Rail cannot maintain continuous.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ContinuousRailTransitionFailure { get; }
  Visual Basic
Public Shared ReadOnly Property ContinuousRailTransitionFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ContinuousRailTransitionFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace